import sqlite3
import datetime

# SQLite3データベースに接続
conn = sqlite3.connect('iot_hack.db')
c = conn.cursor()

# ダミーデータの挿入
data = [
    ('宇多津駅南口', 1, 3, '2024-12-07 07:00:00'),
    ('宇多津町役場', 2, 0, '2024-12-07 07:05:00'),
    ('山下', 8, 0, '2024-12-07 07:06:00'),
    ('やすらぎプラザ', 1, 5, '2024-12-07 07:07:00'),
    ('田町', 3, 2, '2024-12-07 07:07:00'),
    ('十楽寺', 1, 2, '2024-12-07 07:10:00'),
    ('京都東山前', 1, 6, '2024-12-07 07:11:00'),
    ('鍋谷コミュニティ分館', 7, 0, '2024-12-07 07:11:00'),
    ('県営団地', 4, 8, '2024-12-07 07:13:00'),
    ('宇多津調剤薬局', 4, 0, '2024-12-07 07:13:00'),
    ('マルナカ宇多津店', 1, 5, '2024-12-07 07:15:00'),
    ('宇多津駅南口', 1, 5, '2024-12-07 07:28:00'),
    ('ユープラザうたづ', 6, 0, '2024-12-07 07:28:00'),
    ('浜六番丁コスモス前', 5, 3, '2024-12-07 07:29:00'),
    ('浜八番丁', 1, 0, '2024-12-07 07:31:00'),
    ('産直市うたづ', 1, 2, '2024-12-07 07:33:00'),
    ('宇多津町役場', 3, 4, '2024-12-07 07:36:00'),
    ('マルナカスーパーセンター', 2, 5, '2024-12-07 07:41:00'),
    ('おか泉前', 10, 0, '2024-12-07 07:45:00'),
    ('宇多津駅南口', 5, 6, '2024-12-08 07:50:00')

]

c.executemany("INSERT INTO bus_stop_data (bus_stop_name, passengers_boarded, passengers_alighted, timestamp) VALUES (?, ?, ?, ?)", data)

# 変更を保存してデータベースを閉じる
conn.commit()
conn.close()